package com.xmm.work;

import java.text.SimpleDateFormat;
import java.util.Date;
import java.util.Random;

/**
 * Created by 肖明明 on 2017/3/22.
 */
public class UserAddressTransfer {

    /**
     * 生成新系统的用户地址
     */
    public static void getNewAddress(){
        StringBuffer sb=new StringBuffer();
        sb.append("680,13716208778,刘真卫,河北,130000,邯郸,130400,涉县,130426,开发区龙田公寓楼901#");
        sb.append("121,13716870783,李晶华,北京,110000,北京,110100,丰台区,110106,郭公庄中街21号，万科蓝小区2号楼1单元701#");
        sb.append("681,18610526825,杨一凡,北京,110000,北京,110100,大兴区,110115,经济技术开发区贵园东里13号楼306#");
        sb.append("681,18611591818,宋亮,北京,110000,北京,110100,丰台区,110106,菜户营东街甲88号鹏润家园文苑A座1608#");
        sb.append("682,13810615357,王琨,北京,110000,北京,110100,朝阳区,110105,林萃东路2号院国奥村C6-1-602#");
        sb.append("683,15618229389,张,上海,310000,上海,310100,长宁区,310105,古北路69弄20号2402室#");
        sb.append("684,13001295646,赵淑诚,北京,110000,北京,110100,丰台区,110106,万源路六营门1栋1单元11号#");
        sb.append("685,18611678325,林淮,北京,110000,北京,110100,大兴区,110115,亦庄上海沙龙16－1－201#");
        sb.append("686,13801165490,王鹤,北京,110000,北京,110100,昌平区,110114,融泽嘉园2号院8号楼2505#");
        sb.append("686,13901398211,姚迪,北京,110000,北京,110100,丰台区,110106,方庄芳城园二区4号楼1903室 姚迪#");
        sb.append("687,18622562169,陈女士,北京,110000,北京,110100,通州区,110112,物资学院路天赐良园东三期16号楼212#");
        sb.append("687,13910558670,张瑜,天津,120000,天津,120100,河北区,120105,岷江路开江南里59门307#");
        sb.append("688,13321100976,张岩,北京,110000,北京,110100,海淀区,110108,建材城东路富力桃园小区A15-1001#");
        sb.append("689,18600073636,马女士,北京,110000,北京,110100,西城区,110102,长椿街康乐里小区3号楼401#");
        sb.append("690,18618238808,胡庆红,北京,110000,北京,110100,朝阳区,110105,安苑里1号楼1门503号#");
        sb.append("691,18618172250,李昂,北京,110000,北京,110100,朝阳区,110105,定福庄甲1号美然动力街区a3区9号楼3单元501#");
        sb.append("692,13910586910,丁李莉,北京,110000,北京,110100,朝阳区,110105,利泽东街5号爱立信大厦  爱立信中国通信公司#");
        sb.append("427,13683510089,岳惠敏,北京,110000,北京,110100,西城区,110102,人定湖西里17号楼7门302#");
        sb.append("693,13520561551,刘女士,北京,110000,北京,110100,朝阳区,110105,十里堡都会华庭香港阁12E#");
        sb.append("694,13552578293,曾婷,北京,110000,北京,110100,丰台区,110106,莲香园小区5号楼1508号#");
        sb.append("695,15810833407,许友梅,北京,110000,北京,110100,朝阳区,110105,望京西园三区319楼1406#");
        sb.append("696,13801252834,韩健,北京,110000,北京,110100,丰台区,110106,万源路六营门小区1栋1单元11号#");
        sb.append("697,13801376557,张建华,北京,110000,北京,110100,西城区,110102,西安门大街115号#");
        sb.append("698,13833698584,赵春霞,河北,130000,廊坊,131000,广阳区,131003,阿尔卡迪亚帝景园7号楼5单元402室#");
        sb.append("334,15611151151,邹若碧,北京,110000,北京,110100,西城区,110102,菜市口枫华豪景A座6单元1202#");
        sb.append("334,13801325936,苏鹏,北京,110000,北京,110100,朝阳区,110105,望京东园五区505楼1单元3203室#");
        sb.append("334,13401055699,何佳镁,北京,110000,北京,110100,朝阳区,110105,广泽路6号果岭里小区6号楼1单元101室#");
        sb.append("408,18210269116,安安,北京,110000,北京,110100,朝阳区,110105,望京南湖南路16号金石美苑313-3-901#");
        sb.append("699,13466793325,叶梦,北京,110000,北京,110100,海淀区,110108,魏公村小区19号楼1门301#");
        sb.append("700,13681300091,林女士,北京,110000,北京,110100,海淀区,110108,大有北里小区118楼3单元406室（中央党校北门）#");
        sb.append("701,18500055801,郭薇,北京,110000,北京,110100,朝阳区,110105,豆各庄万科青青家园136号楼4门101室#");

        String[] line=sb.toString().split("#");
        for(int i=0;i<line.length;i++){
            String[] row=line[i].split(",");
            String value=" ( 0, '"+row[4]+"', '"+row[6]+"', '"+row[8]+"', '"+row[2]+"', '"+row[1]+"', " +
                    "'"+row[9]+"', '"+row[3]+","+row[5]+","+row[7]+"', "+row[0]+", '2017-3-22 00:00:00', 0),";
            System.out.println(value);
        }
    }

    public static String getTradeNo(int id){
        String orderNo = "";
        String date = new SimpleDateFormat("yyMMddHHmm").format(new Date());
        orderNo = date+""+String.format("%06d", Math.abs(id))+""+(new Random().nextInt(90)+10);
        return orderNo;
    }

    public static void main(String[] args) {
        
        
    }
    
    
}
